app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "saul@anderson.us"]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "last_sign_in_ip" = ?, "current_sign_in_ip" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
      def create
        user_password = params[:session][:password]
        user_email    = params[:session][:email]
        user          = user_email.present? && User.find_by(email: user_email)

        if user.valid_password? user_password
          sign_in(user, store: false)
          user.generate_authentication_token!
          user.save

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT 1  [["auth_token", "yQ2xzMnAqM7JCMzo_6K4"]]
UPDATE "users" SET "auth_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["auth_token", "qoFWZW-JVpXRrGs2TguH"], ["updated_at", "2016-03-27 15:24:24.869249"], ["id", 6]]
---
      def destroy
        user = User.find_by(auth_token: params[:id])
        user.generate_authentication_token!
        user.save