app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
      def show
        respond_with User.find(params[:id])

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?)
---
      def create
        user = User.new(user_params)
        if user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "newmail@example.com"], ["updated_at", "2016-03-27 15:24:24.639123"], ["id", 4]]
---
      def update
        user = current_user

        if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
      def destroy
        user = current_user
        user.destroy